[
  {
    "id": "doc_001",
    "title": "Q2 2024 Financial Report - Executive Summary",
    "content": "Q2 2024 showed strong performance with revenue growth of 15% YoY. Key highlights include improved operational efficiency and successful market expansion. Total revenue reached $45.2M compared to $39.3M in Q2 2023. Operating expenses were controlled at $32.1M, representing a 71% expense ratio. Net profit margin improved to 18.5% from 16.2% last year. EBITDA increased to $15.8M. Strategic investments in R&D continued as planned with $4.2M allocated. AccountNumber AC847392 processed the quarterly dividends totaling $2.8M distributed to shareholders. Cash reserves stand at $28.5M with minimal debt. Key performance indicators: Customer acquisition cost decreased by 12%, lifetime value increased by 23%, monthly recurring revenue grew to $14.8M. Contact: finance@company.com for detailed breakdowns.",
    "domain": "finance",
    "author": "Finance Team",
    "date": "2024-07-15",
    "classification": "confidential"
  },
  {
    "id": "doc_002",
    "title": "Employee Benefits Overview 2024",
    "content": "Our comprehensive benefits package includes health insurance (medical, dental, vision) with 90% employer premium coverage, 401(k) matching up to 6% of salary, unlimited PTO policy with minimum 15 days encouraged, professional development budget of $2,500 per employee annually, remote work flexibility with home office stipend of $500, wellness programs including gym membership reimbursement, mental health counseling, and employee assistance programs. New hires become eligible after 90 days. Salary ranges from $65,000 to $150,000 depending on role and experience with transparent salary bands. Additional perks: commuter benefits, parental leave (16 weeks paid), sabbatical program (after 5 years), stock options for senior roles, annual bonuses averaging 10-15%, health savings account with employer contribution. For questions, contact hr@company.com or visit benefits.company.com portal.",
    "domain": "hr",
    "author": "HR Department",
    "date": "2024-01-10",
    "classification": "internal"
  },
  {
    "id": "doc_003",
    "title": "Healthcare Compliance Guidelines - HIPAA Requirements",
    "content": "All staff handling patient information must comply with HIPAA regulations and organizational privacy policies. Protected Health Information (PHI) includes: PatientName, medical record numbers, dates of treatment, SSN 123-45-6789 format data, diagnostic information, treatment plans, insurance details, and any information that could identify a patient. Access to PHI is strictly restricted to authorized personnel with legitimate need-to-know. Minimum necessary standard must be applied. Violations may result in termination, civil penalties up to $50,000 per violation, and potential criminal charges. Annual compliance training is mandatory for all staff with quarterly refreshers. Report breaches immediately to compliance@healthorg.com within 24 hours of discovery. Encrypted communication channels must be used for all patient data transfers. Email containing PHI must use secure portal. Physical records must be stored in locked cabinets. Computer screens must auto-lock after 5 minutes of inactivity. Patient consent forms must be obtained and documented. Audit trails reviewed monthly.",
    "domain": "health",
    "author": "Compliance Office",
    "date": "2024-03-20",
    "classification": "confidential"
  },
  {
    "id": "doc_004",
    "title": "Company Public Information and Press Kit",
    "content": "Founded in 2010, our company is a leader in enterprise AI solutions serving over 500 clients globally across healthcare, finance, technology, and manufacturing sectors. Our mission is to make AI trustworthy, transparent, and accessible for all businesses. We specialize in Retrieval-Augmented Generation (RAG) systems, privacy-preserving AI, and compliance-aware machine learning. We operate in North America, Europe, and Asia Pacific regions with offices in San Francisco, London, Singapore, and Tokyo. Our headquarters is located in San Francisco, CA with 350+ employees worldwide. Recent achievements: named Gartner Cool Vendor 2024, Forbes Cloud 100 company, certified SOC 2 Type II. For media inquiries, contact press@company.com. Visit our website at www.company.com for more information, case studies, white papers, and customer testimonials. We are committed to transparency, innovation, customer success, and ethical AI development. Follow us on LinkedIn, Twitter, and GitHub.",
    "domain": "public",
    "author": "Marketing Team",
    "date": "2024-02-01",
    "classification": "public"
  },
  {
    "id": "doc_005",
    "title": "Q1 2024 Sales Performance Report",
    "content": "Q1 sales exceeded targets by 12% achieving $42.8M in bookings versus $38.2M target. Top performing regions were West Coast (30% of revenue, $12.8M) and Northeast (25% of revenue, $10.7M), followed by International (20%, $8.6M) and Southeast (15%, $6.4M). Key accounts include TechCorp ($5.2M annual contract value), FinanceHub ($3.8M), and HealthSystems ($2.9M). Sales team expanded by 8 new hires increasing total sales headcount to 45. Average deal size increased to $175K from $142K in Q4 2023. Sales cycle shortened to 67 days from 89 days. AccountNumber FN982374 holds the commission pool totaling $890,000 for Q1 distribution. CRM data shows 245 active opportunities in pipeline worth $67M projected annual value. Win rate improved to 32% from 28%. Customer churn remained low at 4% annually. Upsell and cross-sell revenue represented 38% of total bookings. New customer acquisition: 28 new logos in Q1. For details, contact sales@company.com or access Salesforce dashboard.",
    "domain": "finance",
    "author": "Sales Operations",
    "date": "2024-04-10",
    "classification": "confidential"
  },
  {
    "id": "doc_006",
    "title": "Employee Onboarding Guide",
    "content": "Welcome to the team! Your first week will include comprehensive orientation covering company history, culture, values, and organizational structure, IT setup with laptop, monitors, software licenses, meeting your team members and cross-functional partners, and initial training sessions on our products and systems. You'll receive your employee handbook detailing all policies, company laptop (MacBook or ThinkPad based on role), access credentials for email, Slack, GitHub, AWS, and other systems, welcome kit with company swag. Please review our code of conduct, non-disclosure agreement, and sign required acknowledgments in the HR portal. Set up direct deposit through our HR portal using your bank account information within first 3 days. Your manager will schedule regular 1-on-1 meetings (weekly initially, then bi-weekly). We encourage you to join employee resource groups (ERGs) for professional development, networking, and diversity initiatives. Participate in company events including all-hands meetings (monthly), team lunches, volunteer days, and annual company retreat. Complete required training courses within 30 days: security awareness, harassment prevention, ethics and compliance. Buddy program: you'll be assigned a peer mentor for the first 90 days. For any questions, reach out to onboarding@company.com or your HR business partner.",
    "domain": "hr",
    "author": "HR Department",
    "date": "2024-01-15",
    "classification": "internal"
  },
  {
    "id": "doc_007",
    "title": "Patient Privacy and Data Security Protocol",
    "content": "This document outlines our comprehensive patient data protection measures aligned with HIPAA, HITECH Act, and state privacy laws. All electronic health records (EHR) are encrypted at rest using AES-256 encryption and in transit using TLS 1.3. Access requires multi-factor authentication with biometric verification for high-privilege users. Patient consent must be obtained before sharing any medical information with third parties. Common identifiers to protect include: full names, SSN 987-65-4321, medical record numbers MRN445566, insurance policy numbers, dates of birth, phone numbers, email addresses, IP addresses, biometric data (fingerprints, retinal scans), photographic images, and any unique identifying numbers. Role-based access control (RBAC) limits data access to minimum necessary for job function. Audit logs track all data access, modifications, and deletions with user attribution and timestamps. Security incidents must be reported within 24 hours to security@healthorg.com and CISO. Breach notification protocols follow 60-day federal requirements. Annual security assessments conducted by third-party auditors (last audit: 98% compliance score). Penetration testing performed quarterly. Employee security training required annually with 95% completion rate. Data retention policy: 7 years for medical records, purged securely after. Third-party vendors must sign Business Associate Agreements (BAA) and undergo security review. Incident response team available 24/7.",
    "domain": "health",
    "author": "Information Security",
    "date": "2024-05-12",
    "classification": "confidential"
  },
  {
    "id": "doc_008",
    "title": "Corporate Social Responsibility Report 2024",
    "content": "Our commitment to sustainability and social impact continues to grow with measurable results. In 2024, we achieved carbon neutrality across all operations through renewable energy credits and carbon offset programs. Donated $1M to educational nonprofits focused on STEM education, digital literacy, and underrepresented communities in tech. Employees volunteered 5,000+ hours to community service including coding bootcamps, career mentorship, and pro bono consulting for nonprofits. Our diversity and inclusion initiatives increased representation of underrepresented groups by 15% with women now comprising 42% of workforce and 35% of leadership. BIPOC representation increased to 38% across all levels. Pay equity audit showed 98% gender pay parity. We partner with organizations including Code2040, Girls Who Code, and Black in AI focused on STEM education and digital literacy. Environmental initiatives include: 100% renewable energy in all offices, zero waste to landfill goal (currently 85% diversion rate), sustainable supply chain practices requiring suppliers to meet environmental standards, reduced business travel with virtual-first meetings saving 500 tons CO2. Employee commuter benefits encourage public transit, biking, and carpooling. Community investment: $500K in local grants supporting affordable housing and food security. Read our full impact report with detailed metrics at www.company.com/impact. Third-party ESG rating: AA (MSCI).",
    "domain": "public",
    "author": "Corporate Affairs",
    "date": "2024-06-01",
    "classification": "public"
  },
  {
    "id": "doc_009",
    "title": "Legal Contract Management Guidelines",
    "content": "All contracts must be reviewed by legal counsel before execution to ensure compliance with company policies and applicable laws. Standard contract elements include: scope of work with detailed deliverables, payment terms including schedule and amounts, confidentiality and non-disclosure clauses protecting proprietary information, intellectual property ownership and licensing terms, liability limitations and indemnification provisions, insurance requirements, termination conditions including notice periods and breach remedies, dispute resolution procedures favoring arbitration, governing law and jurisdiction clauses. Authorized signatories are listed in the company directory with delegation of authority matrix: CFO for contracts >$500K, VP level for $100K-$500K, Director level for <$100K. Store executed contracts in the secure document management system (NetDocuments) with proper metadata tagging. Major contracts (>$100K) require board approval at quarterly meetings. Confidential vendor agreements must not disclose pricing structures or AccountNumber LG773821 payment details publicly. Contract review SLA: 5 business days for standard contracts, 10 days for complex agreements. Legal holds must be honored immediately when issued. For contract questions, templates, or legal consultation, contact legal@company.com or schedule through legal portal. Annual contract audit ensures compliance and identifies renewal opportunities. Key vendor relationships managed through vendor management system with performance scorecards.",
    "domain": "legal",
    "author": "Legal Department",
    "date": "2024-02-20",
    "classification": "internal"
  },
  {
    "id": "doc_010",
    "title": "Technology Stack and Infrastructure Overview",
    "content": "Our technology infrastructure leverages modern cloud-native architecture primarily on AWS (Amazon Web Services) with multi-region deployment for high availability and disaster recovery. Core programming languages and frameworks include: Python 3.11+ for backend services and ML pipelines, Node.js 18+ for API services, React 18 with TypeScript for frontend applications, PostgreSQL 15 for relational data, MongoDB for document storage. We use Docker for containerization and Kubernetes (EKS) for orchestration with auto-scaling based on traffic. CI/CD pipelines managed through GitHub Actions with automated testing, security scanning, and deployment to staging and production environments. Infrastructure as Code using Terraform and CloudFormation. Monitoring and observability stack: Datadog for metrics and APM, Sentry for error tracking, PagerDuty for incident management, ELK stack (Elasticsearch, Logstash, Kibana) for log aggregation and analysis. Our AI/ML technology stack includes: PyTorch 2.0 for deep learning, TensorFlow for production models, LangChain for LLM orchestration, OpenAI API for GPT models, Pinecone for vector database enabling semantic search at scale, Hugging Face transformers for NLP. Data storage architecture combines: S3 for object storage (data lake), RDS PostgreSQL for transactional data, RedShift for data warehouse and analytics, Pinecone vector database for embeddings (1024-dimension text-embedding-3-large), Redis for caching with sub-millisecond latency. Security practices: all data encrypted at rest and in transit, AWS KMS for key management, IAM roles and policies following least privilege, regular security audits and penetration testing, vulnerability scanning in CI/CD, SOC 2 Type II compliant, secrets management using AWS Secrets Manager. Development practices: Git flow branching strategy, code reviews required for all changes, automated testing with >80% coverage requirement, documentation in Confluence, API documentation with OpenAPI/Swagger. For technical documentation, architecture decision records, runbooks, and onboarding guides, visit docs.internal.company.com. Technical support: dev-support@company.com.",
    "domain": "public",
    "author": "Engineering Team",
    "date": "2024-04-05",
    "classification": "public"
  },
  {
    "id": "doc_011",
    "title": "Annual Performance Review Process",
    "content": "Performance reviews are conducted annually each December with mid-year check-ins in June. The comprehensive process includes: employee self-assessment (1-2 pages reflecting on accomplishments, challenges, and growth), manager evaluation with detailed feedback on performance against goals, 360-degree peer feedback from 3-5 colleagues providing perspective on collaboration and impact, and skip-level review for senior roles. Evaluation criteria cover multiple dimensions: goal achievement and OKRs (40% weight) measuring individual and team objectives, core competencies (30%) including problem-solving, communication, technical skills, leadership behaviors (20%) for management roles including people development and strategic thinking, cultural fit (10%) demonstrating company values. Performance ratings use 5-point scale: 1 (needs improvement - performance improvement plan required), 2 (developing - meets some expectations), 3 (successful - meets all expectations, majority of employees), 4 (strong - exceeds expectations in multiple areas), 5 (exceptional - far exceeds expectations, top 5% of company). Compensation adjustments based on: individual performance rating, internal equity analysis, external market data from Radford surveys, budget allocation typically 3-5% of payroll. Typical salary increases: rating 3 receives 2-4%, rating 4 receives 5-8%, rating 5 receives 8-12%. Promotions considered for employees consistently rated 4+ with demonstrated next-level competencies. Bonuses are discretionary and may reach 10-15% of base salary for rating 3, 15-20% for rating 4, and 20-30% for rating 5. Equity refreshers for senior roles and top performers. Development plans created for all employees identifying: skills to develop, stretch assignments, training courses, mentorship opportunities. Underperformers (rating 1-2) placed on 90-day performance improvement plans with specific measurable goals and weekly check-ins. Timeline: self-assessments due Nov 15, peer feedback Nov 30, manager reviews Dec 15, calibration meetings Dec 20, employee conversations by Dec 31, compensation changes effective Jan 1. Contact hr-reviews@company.com for questions, templates, or manager coaching on delivering feedback.",
    "domain": "hr",
    "author": "HR Department",
    "date": "2024-11-01",
    "classification": "internal"
  },
  {
    "id": "doc_012",
    "title": "Medical Equipment Maintenance Schedule",
    "content": "All medical equipment must follow strict maintenance schedules per manufacturer guidelines, FDA regulations, and Joint Commission requirements. Critical life-support devices (ventilators, anesthesia machines, patient monitors, infusion pumps, defibrillators, imaging equipment including MRI, CT, X-ray) receive quarterly preventive maintenance inspections by certified biomedical technicians. Non-critical equipment receives semi-annual maintenance. Comprehensive maintenance logs must document: equipment ID (format: MED-8847), asset tag number, inspection date and time, biomedical technician name and certification number, issues found with severity classification, corrective actions taken, parts replaced with serial numbers, calibration results, quality assurance testing results, next scheduled maintenance date, and authorizing signature. Any equipment failures, unusual readings, or safety concerns must be reported immediately to biomedical engineering on-call (24/7 pager). Patient safety is paramount - immediately tag and remove from service any equipment showing error codes, physical damage, failed safety checks, or calibration out of tolerance. Equipment must not be used until certified safe by biomedical engineering. Service contracts managed through vendor portal with SLA tracking: emergency repairs within 4 hours, routine repairs within 24 hours, parts availability guarantees. Equipment calibration certificates must be current and posted on equipment. Annual safety inspections required for electrical safety testing. Equipment lifecycle management: devices tracked from procurement through disposal with 7-10 year typical lifecycle. Replacement planning based on age, maintenance costs, and technology obsolescence. Medical device reporting (MDR) to FDA required for serious injuries or malfunctions. Staff training required on equipment proper use and basic troubleshooting. Preventive maintenance completion rate target: >98%. Contact maintenance@healthorg.com for service requests, equipment loans from pool, or urgent repairs. Equipment downtime tracked and reported in monthly quality metrics.",
    "domain": "health",
    "author": "Facilities Management",
    "date": "2024-03-15",
    "classification": "internal"
  },
  {
    "id": "doc_013",
    "title": "Q3 2024 Product Roadmap and Feature Releases",
    "content": "Q3 product roadmap focuses on three strategic initiatives: enhancing our RAG platform with multi-modal capabilities, expanding compliance framework coverage, and improving developer experience. Major feature releases: RAG 2.0 with support for PDF parsing, image understanding via GPT-4V, and table extraction achieving 95% accuracy. Multi-agent orchestration system enabling complex task decomposition with specialized agents for retrieval, analysis, and summarization. Enhanced caching layer reducing query latency by 80% for repeated queries using Redis-backed distributed cache. Pinecone integration as primary vector store supporting millions of documents with sub-100ms query times. Compliance module expansion adding support for CCPA, GDPR Article 30, and SOC 2 Type II validation. Real-time monitoring dashboard with Prometheus metrics and Grafana visualizations. Developer experience improvements: comprehensive SDK documentation, interactive Jupyter notebooks, Postman collections for API testing, video tutorials. Performance optimizations: batch processing for bulk document indexing, streaming responses for large outputs, smart chunking for long documents. Security enhancements: API key rotation, rate limiting per user/org, audit log export for compliance reporting. Integration partners: Slack bot for conversational queries, Salesforce connector for CRM data, Notion integration for knowledge base sync. Beta features in testing: fine-tuned embeddings for domain-specific retrieval, graph RAG for relationship queries, federated search across multiple knowledge bases. Customer-requested features: custom PII patterns, role hierarchy support, document versioning, scheduled report generation. Release schedule: September 15 for RAG 2.0, October 1 for compliance module, November 10 for developer SDK. Engineering team allocated: 8 engineers on core platform, 3 on compliance, 2 on devex. Contact product@company.com for feature requests or early access program.",
    "domain": "public",
    "author": "Product Management",
    "date": "2024-08-20",
    "classification": "public"
  },
  {
    "id": "doc_014",
    "title": "Information Security Policy and Best Practices",
    "content": "Enterprise information security policy establishes requirements for protecting company and customer data. All employees must complete annual security awareness training covering: phishing identification (test campaigns quarterly), password hygiene (minimum 12 characters, password manager required), social engineering tactics, data classification, incident reporting procedures. Access management: least privilege principle, regular access reviews quarterly, immediate termination of access for departures, MFA required for all systems, SSO via Okta for unified access control. Data classification levels: Public (website content, marketing materials), Internal (business plans, roadmaps, general communications), Confidential (financial data, customer information, trade secrets, source code), Restricted (PHI, PII, payment card data requiring strongest controls). Handling requirements vary by classification: encryption for Confidential/Restricted data, secure deletion procedures, restricted sharing only via approved channels, automatic classification labels in email and documents. Asset management: all company devices inventoried, full disk encryption mandatory, automatic screen lock after 5 minutes, antivirus and EDR (CrowdStrike) required, automatic patching enabled, MDM enrollment for mobile devices. Network security: VPN required for remote access, firewall rules restrict traffic, network segmentation isolates sensitive systems, IDS/IPS monitors threats, web filtering blocks malicious sites. Acceptable use: no personal use of company resources for illegal activities, no unauthorized software installation, no sharing credentials, report suspicious emails and links. Data loss prevention (DLP): automated scanning prevents sensitive data exfiltration via email, USB, cloud storage with policy violations flagged. Vendor security: third-party risk assessments required, security questionnaires evaluated, data processing agreements (DPA) for vendors handling customer data, annual vendor reviews. Incident response: IR team available 24/7, escalation procedures documented, tabletop exercises conducted quarterly, post-incident reviews identify lessons learned. Compliance audits: SOC 2 Type II annual audit, PCI DSS for payment systems, HIPAA for healthcare customers, ISO 27001 in progress. Security metrics tracked: phishing simulation click rate (target <5%), vulnerability remediation time (critical within 7 days), incidents per month, training completion rate. Contact security@company.com for questions, reporting suspicious activity, or requesting security exceptions. Physical security: badge access to facilities, visitor sign-in required, clean desk policy for sensitive materials, secure disposal (shred bins for paper, certified e-waste for devices).",
    "domain": "public",
    "author": "CISO Office",
    "date": "2024-07-01",
    "classification": "public"
  },
  {
    "id": "doc_015",
    "title": "Remote Work and Hybrid Policy",
    "content": "Our flexible work policy supports remote, hybrid, and office-based work arrangements recognizing diverse employee needs while maintaining collaboration and productivity. Work location options: Fully remote (can work from anywhere in country where we have legal entity), Hybrid (2-3 days in office per week, flexible schedule), Office-based (primarily in office 4-5 days per week). Role eligibility: most roles eligible for remote/hybrid, some roles require office presence for equipment access, customer-facing, or security reasons. Manager approval required for remote work with considerations for: role requirements, team collaboration needs, individual performance, work style. Home office requirements: dedicated workspace free from distractions, reliable high-speed internet (minimum 50 Mbps download), appropriate lighting and ergonomic setup, secure environment meeting security policy. Equipment provided: laptop, monitor(s), keyboard, mouse, headset, webcam if needed. Home office stipend: $500 one-time setup allowance for furniture and accessories, $100 monthly for internet and phone. Communication expectations: availability during core hours (10am-4pm local time), response time within 2 hours during business hours, video-on preferred for meetings to maintain connection, regular team updates via Slack. Collaboration guidelines: schedule regular in-person team meetings quarterly, use shared documents and project management tools, overcommunicate progress and blockers, leverage async communication when possible. Meeting etiquette: agenda and materials shared 24 hours in advance, recordings for those unable to attend, captions enabled for accessibility, include remote participants via video conference. Performance management: outcomes-focused rather than activity-tracking, regular 1-on-1s to maintain connection, documented goals and deliverables, feedback based on results and impact. Work-life balance: respect off-hours and weekends, avoid messaging outside business hours, use vacation time fully, no expectation of immediate responses. Travel policy: teams should gather in-person at least quarterly for team building and planning, annual company meeting brings everyone together, travel budget allocated per team. Office space: hot-desking available, reservable meeting rooms, collaboration spaces, quiet zones for focused work. International remote work requires special approval and tax/legal review. Contact remote-work@company.com for questions, workspace issues, or equipment needs. Annual surveys gather feedback on remote work experience to continuously improve policy.",
    "domain": "hr",
    "author": "HR Department",
    "date": "2024-03-01",
    "classification": "internal"
  }
]

